{
	"title": "Working Experience",
	"sections": [
		{
			"image": "assets/evooq.jpg",
			"details": [
				{
					"description": "Sep 2019 - Present",
					"icon": "calendar"
				},
				{
					"description": "Evooq",
					"icon": "team"
				},
				{
					"description": "Software Engineer",
					"icon": "experiment"
				},
				{
					"description": "Zurich, Switzerland",
					"icon": "pushpin"
				}
			],
			"description": "Working as Frontend Developer and Scrum Master for a life-cycle management tool. The app is part of a bigger ecosystem of applications, in the area of financial digital business. The apps are implemented in Angular 8, Typescript, HTML, CSS, Ant Design and served by graphql endpoints. We work in a SCRUM team, with recurring dailies, planning, groomings and retrospective supported by Jira for the management of the tickets."
		},
		{
			"image": "assets/owt.png",
			"details": [
				{
					"description": "Jan 2019 - Aug 2019",
					"icon": "calendar"
				},
				{
					"description": "Open Web Technology",
					"icon": "team"
				},
				{
					"description": "Senior Frontend Dev",
					"icon": "experiment"
				},
				{
					"description": "Zurich, Switzerland",
					"icon": "pushpin"
				}
			],
			"description": "Worked as senior front-end developer for different web based b2b and b2c applications. The applications were implemented in the UI with Aurelia and Angular as frameworks, typescript, HTML5 and CSS3, and were served by REST APIs implemented in Java. As main testing frameworks Jasmine for unit test and TestCafe for end to end.As development process SCRUM supported by Jira for the tickets handling and Confluence for the documentation."
		},
		{
			"image": "assets/avaloq.png",
			"details": [
				{
					"description": "Nov 2015 - Dic 2018",
					"icon": "calendar"
				},
				{
					"description": "Avaloq",
					"icon": "team"
				},
				{
					"description": "Software Engineer",
					"icon": "experiment"
				},
				{
					"description": "Zurich, Switzerland",
					"icon": "pushpin"
				}
			],
			"description": "Worked as front-end developer for e-banking web applications in the area of payment and trading. The applications were implemented with angularJs, javascript, HTML5 and CSS3, and served by REST APIs implemented in Java. For testing Jasmine for unit test, and Selenium for end-to-end. As development process SCRUM/Kanban supported by Jira for the tickets handling and Confluence for the documentation."
		}
	]
}